package chapter08;

public class chapter08 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		/*
		 *인터페이스는 객체의 사용 방법을 정의한 타입이다.
		 * 인터페이스로 구현 객체를 사용하려면 다음과 같이 인터페이스 변수를 선언하고 구현 객체를 대입 해야한다
		 * 인터페이스 변수는 참조 탕비이기 때문에 구현 객 체가 대입될 경우 구현 객체의 번지를 저장한다.
		 * 
		 * 인터페이스 변수;  인터페이스 변수=구현 객체;
		 * 변수 = 구현객체;
		 */
		
		/*
		 * 인터페이스에서 디폴트 메소드를 허용한 이유는 기존 인터페스를 확장해서 새로운 기능을 추가하기 위해서이다.
		 * 기존 인터페이스의 이름과 추상 메소드의 변경 없이 디폴트 메소드만 추가할 수 있기때문에 이전에 개발
		 * 한 구현 클래스를 그대로사용할 수 있으면서 새롭게 개발하는 클래스는 디폴트 메소드를 활용할 수 있다.
		 */
	}

}
